"""
По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b, проходящей через эти точки.
"""
print('Введите координаты первой точки:')
x1 = int(input('Введите x: '))
y1 = int(input('Введите y: '))
print('Введите координаты второй точки:')
x2 = int(input('Введите x: '))
y2 = int(input('Введите y: '))
if x1 == x2 and y1 == y2:
    print('Введите 2 разные точки!')
else:
    if (x1 != 0 and x2 != 0):
        if x1 != x2:
            if y1 != 0 and y2 != 0:
                k = (y2 - y1) / (x2 - x1)
                b = y1 - k * x1
                print(f'y = {k}x + ({b})')
            else:
                print('y = 0; ось ординат.')
        else:
            print(f'x = {x1}')
    else:
        print('y = 0; ось абсцисс.')

